#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "created-by"   = "terraform"
          + "created-from" = "dev-tfvars"
        }
      + location                    = "EUROPE-NORTH1"
      + name                        = "example-slim"
      + project                     = "module-dev"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 14
              + matches_storage_class = []
              + with_state            = "ARCHIVED"
            }
        }
      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 7
              + matches_storage_class = [
                  + "STANDARD",
                ]
              + with_state            = "LIVE"
            }
        }

      + retention_policy {
          + is_locked        = false
          + retention_period = 604800
        }

      + versioning {
          + enabled = false
        }
    }

  # google_storage_bucket_iam_member.backup_viewer[0] will be created
  + resource "google_storage_bucket_iam_member" "backup_viewer" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:yolo@wan.kanobi"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.iam_legacy_bucket_reader["serviceAccount:yolo@wan.kanobi"] will be created
  + resource "google_storage_bucket_iam_member" "iam_legacy_bucket_reader" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:yolo@wan.kanobi"
      + role   = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_member.iam_legacy_bucket_reader["serviceaccount:example@reader2.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_legacy_bucket_reader" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceaccount:example@reader2.com"
      + role   = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_member.iam_legacy_bucket_reader["user:example@reader.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_legacy_bucket_reader" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:example@reader.com"
      + role   = "roles/storage.legacyBucketReader"
    }

  # google_storage_bucket_iam_member.iam_legacy_bucket_writer["serviceaccount:example@writer2.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_legacy_bucket_writer" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceaccount:example@writer2.com"
      + role   = "roles/storage.legacyBucketWriter"
    }

  # google_storage_bucket_iam_member.iam_legacy_bucket_writer["user:example@writer.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_legacy_bucket_writer" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:example@writer.com"
      + role   = "roles/storage.legacyBucketWriter"
    }

  # google_storage_bucket_iam_member.iam_object_creator["serviceaccount:example@writer2.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_object_creator" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceaccount:example@writer2.com"
      + role   = "roles/storage.objectCreator"
    }

  # google_storage_bucket_iam_member.iam_object_creator["user:example@writer.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_object_creator" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:example@writer.com"
      + role   = "roles/storage.objectCreator"
    }

  # google_storage_bucket_iam_member.iam_object_viewer["serviceAccount:yolo@wan.kanobi"] will be created
  + resource "google_storage_bucket_iam_member" "iam_object_viewer" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:yolo@wan.kanobi"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.iam_object_viewer["serviceaccount:example@reader2.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_object_viewer" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceaccount:example@reader2.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.iam_object_viewer["user:example@reader.com"] will be created
  + resource "google_storage_bucket_iam_member" "iam_object_viewer" {
      + bucket = "example-slim"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:example@reader.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_transfer_job.backup[0] will be created
  + resource "google_storage_transfer_job" "backup" {
      + creation_time          = (known after apply)
      + deletion_time          = (known after apply)
      + description            = "Nightly backup for example-slim"
      + id                     = (known after apply)
      + last_modification_time = (known after apply)
      + name                   = (known after apply)
      + project                = "module-dev"
      + status                 = "ENABLED"

      + schedule {

          + schedule_start_date {
              + day   = 1
              + month = 1
              + year  = 2021
            }

          + start_time_of_day {
              + hours   = 3
              + minutes = 0
              + nanos   = 0
              + seconds = 0
            }
        }

      + transfer_spec {

          + gcs_data_sink {
              + bucket_name = "backup-example-slim"
            }

          + gcs_data_source {
              + bucket_name = "example-slim"
            }

          + object_conditions {
              + max_time_elapsed_since_last_modification = "86400s"
            }

          + transfer_options {
              + delete_objects_from_source_after_transfer  = false
              + delete_objects_unique_in_sink              = false
              + overwrite_objects_already_existing_in_sink = true
            }
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
